### 数字货币量化入门

## 第一章：

### 1.1. python 语言入门

### 1.2. 常用模块

- ccxt (最常用的交易所封包。支持100多家主流交易所)
- json (网络通讯时最常用的数据格式)
- Ta-Lib (简单强大的指标运算库)
- request (简单易用的网络通讯库)
- threading (多线程处理模块) 
- numpy && pandas (功能强大的数据处理模块)
- websocket (高频交易必备通讯模块。可以提供数据传输速率，规避限频问题)
- decimal (必备，十进制数据处理模块。解决二进制转换bug)
- hashlib\hmac (常用的加密模块)

### 1.3. 环境搭建

- 服务器的选择
- Linux常用命令
- webhook实现报警
- 本地测试环境搭建

### 1.4 交易所封包

- ccxt使用简介
- 自助封包
  - 加密模块
  - 网络请求介绍
- 网络抓包（破解无api交易所或破除交易限制）

## 第二章 策略回测

### 2.1 工具

- python
  - numpy && pandas
  - talib
- excel

### 2.2 回测数据获取

- 交易所自带数据
  - 币安
  - Bitmex
- 其他获取渠道

## 第三章

### 3.1 程序设计思路

### 3.2 性能优化思路

### 3.3 异常处理提高稳定性

### 3.4 其他

- 同步、异步的处理
- 限频问题
- 使用效率更高的语言替换python
